FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
            if( ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES ) )
            {
                ETH_L3FilterConfigTypeDef xL3FilterConfig;

                /* Filter out all possibilities if frame type is disabled */
                if( ipconfigIS_DISABLED( ipconfigUSE_IPv4 ) )
                {
                    /* Block IPv4 if it is disabled */
                    ( void ) HAL_ETHEx_GetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_0, &xL3FilterConfig );
                    xL3FilterConfig.Protocol = ETH_L3_IPV4_MATCH;
                    xL3FilterConfig.SrcAddrFilterMatch = ETH_L3_SRC_ADDR_PERFECT_MATCH_ENABLE;
                    xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_PERFECT_MATCH_ENABLE;
                    xL3FilterConfig.SrcAddrHigherBitsMatch = 0x1FU;
                    xL3FilterConfig.DestAddrHigherBitsMatch = 0x1FU;
                    xL3FilterConfig.Ip4SrcAddr = ipBROADCAST_IP_ADDRESS;
                    xL3FilterConfig.Ip4DestAddr = ipBROADCAST_IP_ADDRESS;
                    ( void ) HAL_ETHEx_SetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_0, &xL3FilterConfig );
                }

                if( ipconfigIS_DISABLED( ipconfigUSE_IPv6 ) && ( ucFilterCount > 1 ) )
                {
                    /* Block IPv6 if it is disabled */
                    ( void ) HAL_ETHEx_GetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_1, &xL3FilterConfig );
                    xL3FilterConfig.Protocol = ETH_L3_IPV6_MATCH;
                    xL3FilterConfig.SrcAddrFilterMatch = ETH_L3_SRC_ADDR_PERFECT_MATCH_ENABLE;
                    xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_PERFECT_MATCH_ENABLE;
                    xL3FilterConfig.SrcAddrHigherBitsMatch = 0x1FU;
                    xL3FilterConfig.DestAddrHigherBitsMatch = 0x1FU;
                    xL3FilterConfig.Ip6Addr[ 0 ] = 0xFFFFFFFFU;
                    xL3FilterConfig.Ip6Addr[ 1 ] = 0xFFFFFFFFU;
                    xL3FilterConfig.Ip6Addr[ 2 ] = 0xFFFFFFFFU;
                    xL3FilterConfig.Ip6Addr[ 3 ] = 0xFFFFFFFFU;
                    ( void ) HAL_ETHEx_SetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_1, &xL3FilterConfig );
                }

                for( NetworkEndPoint_t * pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface ); pxEndPoint != NULL; pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
                {
                    if( ENDPOINT_IS_IPv4( pxEndPoint ) )
                    {
                        if( ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) )
                        {
                            ( void ) HAL_ETHEx_GetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_0, &xL3FilterConfig );
                            xL3FilterConfig.Protocol = ETH_L3_IPV4_MATCH;
                            xL3FilterConfig.SrcAddrFilterMatch = ETH_L3_SRC_ADDR_MATCH_DISABLE;
                            xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_MATCH_DISABLE;
                            xL3FilterConfig.SrcAddrHigherBitsMatch = 0U /* Don't Care */;
                            xL3FilterConfig.DestAddrHigherBitsMatch = 0x1FU;
                            xL3FilterConfig.Ip4SrcAddr = 0U /* Don't Care */;
                            xL3FilterConfig.Ip4DestAddr = pxEndPoint->ipv4_settings.ulIPAddress;
                            ( void ) HAL_ETHEx_SetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_0, &xL3FilterConfig );
                        }
                    }
                    else if( ENDPOINT_IS_IPv6( pxEndPoint ) )
                    {
                        if( ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) && ( ucFilterCount > 1 ) )
                        {
                            ( void ) HAL_ETHEx_GetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_1, &xL3FilterConfig );
                            xL3FilterConfig.Protocol = ETH_L3_IPV6_MATCH;
                            xL3FilterConfig.SrcAddrFilterMatch = ETH_L3_SRC_ADDR_MATCH_DISABLE;
                            xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_MATCH_DISABLE;
                            xL3FilterConfig.SrcAddrHigherBitsMatch = 0U; /* Don't Care */
                            xL3FilterConfig.DestAddrHigherBitsMatch = 0x1FU;
                            xL3FilterConfig.Ip6Addr[ 0 ] = 0xFFFFFFFFU;
                            xL3FilterConfig.Ip6Addr[ 1 ] = 0xFFFFFFFFU;
                            xL3FilterConfig.Ip6Addr[ 2 ] = 0xFFFFFFFFU;
                            xL3FilterConfig.Ip6Addr[ 3 ] = 0xFFFFFFFFU;
                            ( void ) HAL_ETHEx_SetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_1, &xL3FilterConfig );
                        }
                    }
                }
            } /* if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES ) */

            if( ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS ) )
            {
                /* TODO: Let user to block certain port numbers */
                /* TODO: Live updated in task based on active sockets? */
                ETH_L4FilterConfigTypeDef xL4FilterConfig;

                /* Always allow all UDP */
                ( void ) HAL_ETHEx_GetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_0, &xL4FilterConfig );
                xL4FilterConfig.Protocol = ETH_L4_UDP_MATCH;
                xL4FilterConfig.SrcPortFilterMatch = ETH_L4_SRC_PORT_MATCH_DISABLE;
                xL4FilterConfig.DestPortFilterMatch = ETH_L4_SRC_PORT_MATCH_DISABLE;
                xL4FilterConfig.SourcePort = 0U;
                xL4FilterConfig.DestinationPort = 0U;
                ( void ) HAL_ETHEx_SetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_0, &xL4FilterConfig );

                if( ipconfigIS_DISABLED( ipconfigUSE_TCP ) )
                {
                    /* Block TCP if it is disabled */
                    ( void ) HAL_ETHEx_GetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_1, &xL4FilterConfig );
                    xL4FilterConfig.Protocol = ETH_L4_TCP_MATCH;
                    xL4FilterConfig.SrcPortFilterMatch = ETH_L4_SRC_PORT_PERFECT_MATCH_ENABLE;
                    xL4FilterConfig.DestPortFilterMatch = ETH_L4_DEST_PORT_PERFECT_MATCH_ENABLE;
                    xL4FilterConfig.SourcePort = 0xFFFFU;
                    xL4FilterConfig.DestinationPort = 0xFFFFU;
                    ( void ) HAL_ETHEx_SetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_1, &xL4FilterConfig );
                }
            }

