FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
            HAL_ETHEx_EnableL3L4Filtering( pxEthHandle );
        }
    }
    #endif /* if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM ) */
}

#endif /* ifdef niEMAC_STM32HX */

/*---------------------------------------------------------------------------*/

static BaseType_t prvPhyInit( ETH_TypeDef * const pxEthInstance, EthernetPhy_t * pxPhyObject )
{
    BaseType_t xResult = pdFAIL;

    vPhyInitialise( pxPhyObject, ( xApplicationPhyReadHook_t ) prvPhyReadReg, ( xApplicationPhyWriteHook_t ) prvPhyWriteReg );

    if( xPhyDiscover( pxPhyObject ) != 0 )
    {
        #if defined( niEMAC_STM32HX ) && ipconfigIS_ENABLED( niEMAC_USE_PHY_INT )
            for( size_t uxCount = 0; uxCount < pxPhyObject->xPortCount; ++uxCount )
            {
                if( pxPhyObject->ulPhyIDs[ uxCount ] == PHY_ID_LAN8742A )
                {
                    xLan8742aObject.DevAddr = pxPhyObject->ucPhyIndexes[ uxCount ];
                    lan8742_IOCtx_t xLan8742aControl = {
                        .Init = NULL,
                        .DeInit = NULL,
                        .WriteReg = ( lan8742_WriteReg_Func ) &prvPhyWriteReg,
                        .ReadReg = ( lan8742_ReadReg_Func ) &prvPhyReadReg,
                        #if ( INCLUDE_vTaskDelay == 1 )
                           .GetTick = ( lan8742_GetTick_Func ) &vTaskDelay,
                        #else
                           .GetTick = ( lan8742_GetTick_Func ) &HAL_GetTick,
                        #endif
                    };
                    ( void ) LAN8742_RegisterBusIO( &xLan8742aObject, &xLan8742aControl );
                    xLan8742aObject.Is_Initialized = 1U;
                    if( LAN8742_EnableIT( &xLan8742aObject, LAN8742_LINK_DOWN_IT ) == LAN8742_STATUS_OK )
                    {
                        pxEthInstance->MACIER |= ETH_MACIER_PHYIE;
                    }
                    break;
                }
                else if( pxPhyObject->ulPhyIDs[ uxCount ] == PHY_ID_DP83848I )
                {
                    xDp83848Object.DevAddr = pxPhyObject->ucPhyIndexes[ uxCount ];
                    dp83848_IOCtx_t xDp83848Control = {
                        .Init = NULL,
                        .DeInit = NULL,
                        .WriteReg = ( dp83848_WriteReg_Func ) &prvPhyWriteReg,
                        .ReadReg = ( dp83848_ReadReg_Func ) &prvPhyReadReg,
                        #if ( INCLUDE_vTaskDelay == 1 )
                           .GetTick = ( dp83848_GetTick_Func ) &vTaskDelay,
                        #else
                           .GetTick = ( dp83848_GetTick_Func ) &HAL_GetTick,
                        #endif
                    };
                    ( void ) DP83848_RegisterBusIO( &xDp83848Object, &xDp83848Control );
                    xDp83848Object.Is_Initialized = 1U;
                    if( DP83848_EnableIT( &xDp83848Object, DP83848_LINK_DOWN_IT ) == DP83848_STATUS_OK )
                    {
                        pxEthInstance->MACIER |= ETH_MACIER_PHYIE;
                    }
                    break;
                }
            }
        #endif /* if defined( niEMAC_STM32HX ) && ipconfigIS_ENABLED( niEMAC_USE_PHY_INT ) */

        xResult = pdPASS;
    }

    return xResult;
}

static BaseType_t prvPhyStart( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface, EthernetPhy_t * pxPhyObject )
{
    BaseType_t xResult = pdFALSE;

    if( prvGetPhyLinkStatus( pxInterface ) == pdFALSE )
    {
        const PhyProperties_t xPhyProperties = {
            #if ipconfigIS_ENABLED( niEMAC_AUTO_NEGOTIATION )
                .ucSpeed = PHY_SPEED_AUTO,
                .ucDuplex = PHY_DUPLEX_AUTO,
            #else
                .ucSpeed = ipconfigIS_ENABLED( niEMAC_USE_100MB ) ? PHY_SPEED_100 : PHY_SPEED_10,
                .ucDuplex = ipconfigIS_ENABLED( niEMAC_USE_FULL_DUPLEX ) ? PHY_DUPLEX_FULL : PHY_DUPLEX_HALF,
            #endif

            #if ipconfigIS_ENABLED( niEMAC_AUTO_CROSS )
                .ucMDI_X = PHY_MDIX_AUTO,
            #elif ipconfigIS_ENABLED( niEMAC_CROSSED_LINK )
                .ucMDI_X = PHY_MDIX_CROSSED,
            #else
                .ucMDI_X = PHY_MDIX_DIRECT,
            #endif
        };

        #if ipconfigIS_DISABLED( niEMAC_AUTO_NEGOTIATION )
            pxPhyObject->xPhyPreferences.ucSpeed = xPhyProperties.ucSpeed;
            pxPhyObject->xPhyPreferences.ucDuplex = xPhyProperties.ucDuplex;
        #endif

        if( xPhyConfigure( pxPhyObject, &xPhyProperties ) == 0 )
        {
            if( prvMacUpdateConfig( pxEthHandle, pxPhyObject ) != pdFALSE )
            {
                xResult = pdTRUE;
            }
        }
    }
    else
    {
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                           MAC Filtering Helpers                           */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

/* Compute the CRC32 of the given MAC address as per IEEE 802.3 CRC32 */
static uint32_t prvCalcCrc32( const uint8_t * const pucMACAddr )
{
    uint32_t ulCRC32 = 0xFFFFFFFFU;

    uint32_t ucIndex;
    for( ucIndex = ipMAC_ADDRESS_LENGTH_BYTES; ucIndex > 0; --ucIndex )
    {
        ulCRC32 ^= __RBIT( pucMACAddr[ ipMAC_ADDRESS_LENGTH_BYTES - ucIndex ] );

        uint8_t ucJndex;
        for( ucJndex = 8; ucJndex > 0; --ucJndex )
        {
            if( ulCRC32 & 0x80000000U )
            {
                ulCRC32 <<= 1;
                ulCRC32 ^= niEMAC_CRC_POLY;
            }
            else
            {
                ulCRC32 <<= 1;
            }
        }
    }

    return ~ulCRC32;
}

/*---------------------------------------------------------------------------*/

static uint8_t prvGetMacHashIndex( const uint8_t * const pucMACAddr )
{
    const uint32_t ulHash = prvCalcCrc32( pucMACAddr );
    const uint8_t ucHashIndex = ( ulHash >> 26 ) & 0x3FU;

    return ucHashIndex;
}

