FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              EMAC Helpers                                 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static void prvReleaseTxPacket( ETH_HandleTypeDef * pxEthHandle )
{
    if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_TX_MAX_BLOCK_TIME_MS ) ) != pdFALSE )
    {
        ( void ) HAL_ETH_ReleaseTxPacket( pxEthHandle );
        ( void ) xSemaphoreGive( xTxMutex );
    }
    else
    {
        FreeRTOS_debug_printf( ( "prvReleaseTxPacket: Failed\n" ) );
    }

    /* TODO: Is it possible for the semaphore and BuffersInUse to get out of sync? */
    /* while( ETH_TX_DESC_CNT - uxQueueMessagesWaiting( ( QueueHandle_t ) xTxDescSem ) > pxEthHandle->TxDescList.BuffersInUse )
    {
        ( void ) xSemaphoreGive( xTxDescSem );
    } */
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvMacUpdateConfig( ETH_HandleTypeDef * pxEthHandle, EthernetPhy_t * pxPhyObject )
{
    BaseType_t xResult = pdFALSE;

    if( pxEthHandle->gState == HAL_ETH_STATE_STARTED )
    {
        ( void ) HAL_ETH_Stop_IT( pxEthHandle );
    }

    ETH_MACConfigTypeDef xMACConfig;
    ( void ) HAL_ETH_GetMACConfig( pxEthHandle , &xMACConfig );

    #if ipconfigIS_ENABLED( niEMAC_AUTO_NEGOTIATION )
        ( void ) xPhyStartAutoNegotiation( pxPhyObject, xPhyGetMask( pxPhyObject ) );
    #else
        ( void ) xPhyFixedValue( pxPhyObject, xPhyGetMask( pxPhyObject ) );
    #endif
    xMACConfig.DuplexMode = ( pxPhyObject->xPhyProperties.ucDuplex == PHY_DUPLEX_FULL ) ? ETH_FULLDUPLEX_MODE : ETH_HALFDUPLEX_MODE;
    xMACConfig.Speed = ( pxPhyObject->xPhyProperties.ucSpeed == PHY_SPEED_10 ) ? ETH_SPEED_10M : ETH_SPEED_100M;

    if( HAL_ETH_SetMACConfig( pxEthHandle, &xMACConfig ) == HAL_OK )
    {
        xResult = pdTRUE;
    }

    /* #if ipconfigIS_ENABLED( niEMAC_AUTO_LOW_POWER )
        if( ( pxEthHandle->Init.MediaInterface = HAL_ETH_MII_MODE ) && ( xMACConfig.DuplexMode == ETH_FULLDUPLEX_MODE ) && ( xMACConfig.Speed == ETH_SPEED_100M ) )
        {
            HAL_ETHEx_EnterLPIMode( pxEthHandle, ENABLE, DISABLE );
        }
    #endif */

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvReleaseNetworkBufferDescriptor( NetworkBufferDescriptor_t * const pxDescriptor )
{
    NetworkBufferDescriptor_t * pxDescriptorToClear = pxDescriptor;
    while( pxDescriptorToClear != NULL )
    {
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            NetworkBufferDescriptor_t * const pxNext = pxDescriptorToClear->pxNextBuffer;
        #else
            NetworkBufferDescriptor_t * const pxNext = NULL;
        #endif
        vReleaseNetworkBufferAndDescriptor( pxDescriptorToClear );
        pxDescriptorToClear = pxNext;
    };
}

/*---------------------------------------------------------------------------*/

static void prvSendRxEvent( NetworkBufferDescriptor_t * const pxDescriptor )
{
    const IPStackEvent_t xRxEvent = {
        .eEventType = eNetworkRxEvent,
        .pvData = ( void * ) pxDescriptor
    };
    if( xSendEventStructToIPTask( &xRxEvent, pdMS_TO_TICKS( niEMAC_RX_MAX_BLOCK_TIME_MS ) ) != pdPASS )
    {
        iptraceETHERNET_RX_EVENT_LOST();
        FreeRTOS_debug_printf( ( "prvSendRxEvent: xSendEventStructToIPTask failed\n" ) );
        prvReleaseNetworkBufferDescriptor( pxDescriptor );
    }
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvAcceptPacket( const NetworkBufferDescriptor_t * const pxDescriptor, uint16_t usLength )
{
    BaseType_t xResult = pdFALSE;
    do
    {
        if( pxDescriptor == NULL )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Null Descriptor\n" ) );
            break;
        }

        if( usLength > pxDescriptor->xDataLength )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet size overflow\n" ) );
            break;
        }

        ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
        uint32_t ulErrorCode = 0;
        ( void ) HAL_ETH_GetRxDataErrorCode( pxEthHandle, &ulErrorCode );
        if( ulErrorCode != 0 )
        {
            #if ipconfigIS_ENABLED( niEMAC_DEBUG_ERROR )
                prvHAL_RX_ErrorCallback( pxEthHandle );
            #endif
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Rx Data Error\n" ) );
            break;
        }

        #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES )
            if( eConsiderFrameForProcessing( pxDescriptor->pucEthernetBuffer ) != eProcessBuffer )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvAcceptPacket: Frame discarded\n" ) );
                break;
            }
        #endif

        #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
            #ifdef niEMAC_STM32HX
                const ETH_DMADescTypeDef * const ulRxDesc = ( const ETH_DMADescTypeDef * const ) pxEthHandle->RxDescList.RxDesc[ pxEthHandle->RxDescList.RxDescIdx ];

                const uint32_t ulRxDesc1 = ulRxDesc->DESC1;

                if( ( ulRxDesc1 & ETH_CHECKSUM_IP_PAYLOAD_ERROR ) != 0 )
                {
                    iptraceETHERNET_RX_EVENT_LOST();
                    break;
                }

                if( ( ulRxDesc1 & ETH_CHECKSUM_IP_HEADER_ERROR ) != 0 )
                {
                    iptraceETHERNET_RX_EVENT_LOST();
                    break;
                }

                if( ( ulRxDesc1 & ETH_IP_HEADER_IPV4 ) != 0 )
                {
                    /* Should be impossible if hardware filtering is implemented correctly */
                    configASSERT( ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) );
                    #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
                       /* prvAllowIPPacketIPv4(); */
                    #endif
                }
                else if( ( ulRxDesc1 & ETH_IP_HEADER_IPV6 ) != 0 )
                {
                    /* Should be impossible if hardware filtering is implemented correctly */
                    configASSERT( ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) );
                    #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
                        /* prvAllowIPPacketIPv6(); */
                    #endif
                }

                const uint32_t ulPacketType = ulRxDesc1 & ETH_DMARXNDESCWBF_PT;
                if( ulPacketType == ETH_IP_PAYLOAD_UNKNOWN )
                {
                    iptraceETHERNET_RX_EVENT_LOST();
                    break;
                }
                else if( ulPacketType == ETH_IP_PAYLOAD_UDP )
                {
                    /* prvProcessUDPPacket(); */
                }
                else if( ulPacketType == ETH_IP_PAYLOAD_ICMPN )
                {
                    #if ipconfigIS_DISABLED( ipconfigREPLY_TO_INCOMING_PINGS ) && ipconfigIS_DISABLED( ipconfigSUPPORT_OUTGOING_PINGS )
                        iptraceETHERNET_RX_EVENT_LOST();
                        break;
                    #else
                        /* ProcessICMPPacket(); */
                    #endif
                }
                else if( ulPacketType == ETH_IP_PAYLOAD_TCP )
                {
                    /* Should be impossible if hardware filtering is implemented correctly */
                    configASSERT( ipconfigIS_ENABLED( ipconfigUSE_TCP ) );
                    #if ipconfigIS_ENABLED( ipconfigUSE_TCP )
                        /* xProcessReceivedTCPPacket() */
                    #endif
                }
            #endif

